//--------------------------------------------------------------------
// Институт компьютерных технологий и информационной безопасности ЮФУ
// Кафедра МОП ЭВМ
// Программирование и основы теории алгоритмов
// Проектирование и реализация примитивной рекурсивной функции
// 27.05.2022
//--------------------------------------------------------------------

#include <iostream>
#include <cmath>
using namespace std;

//--------------------------------------------------------------------
// Рекурсивная функция, вычисляющая значения функции
// на вход подаются значения x1 и x2, введённые пользователем
// выводит пошаговый результат схемы рекурсии
// возвращает текущее значение функции
//--------------------------------------------------------------------

int function(int x1, int x2)
{
	if (x1 == 0)
	{
		cout << "f(" << x1 << "," << x2
			<< ") = g(" << x2 << ") = 2" << endl;
		return 2;
	}
	int prev = function(x1 - 1, x2);
	int res = pow(prev, x1 - 1);
	cout << "f(" << x1 << "," << x2 << ") = h(" << x1 - 1 << ", f(" << x1 - 1 << "," << x2 << "), " << x2 << ") = h(" << x1 - 1 << "," << prev << "," << x2 << ") = " << res << endl;
	return res;
}

int main()
{
	setlocale(0, "rus");
	int x1, x2, current = 0;
	cout << "f(0,x2) = g(x2) = 2" << endl;
	cout << "f(x1 + 1,x2) = h(x1, f(x1, x2), x2) = f(x1, x2)^x1" << endl;
	while (true)
	{
		cout << endl << "Введите значения x1 и x2 или -1 -1 для выхода из программы" << endl;
		cin >> x1 >> x2;
		if (x1 == -1 && x2 == -1)
		{
			return 0;
		}
		function(x1, x2);
	}
	return 0;
}

